micropython/micropython/ports/raspberrypi/boards/pimoroni_pico_dv_base_w/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "Pimoroni Pico DV Base W"
#define MICROPY_HW_MCU_NAME "rp2040"

#define CIRCUITPY_DIGITALIO_HAVE_INVALID_PULL (1)
#define CIRCUITPY_DIGITALIO_HAVE_INVALID_DRIVE_MODE (1)

#define DEFAULT_UART_BUS_RX (&pin_GPIO1)
#define DEFAULT_UART_BUS_TX (&pin_GPIO0)
